import React, { useState, useEffect } from "react";
import SectionTitle from "../../components/SectionTitle/SectionTitle";
import ArticlesList from "../../components/ArticlesPage/ArticlesList/ArticlesList";
import Container from "../../components/Container/Container";
import axios from "axios";
import s from "./ArticlesPage.module.css";
import chevronIcon from "../../assets/images/icons/chevron-down.svg";

const demoArticles = [
  {
    _id: {
      $oid: "68498236a100312bea078fe6",
    },
    img: "https://ftp.goit.study/img/harmoniq/f12e886489f94b5886d03e95vn.jpg",
    title: "Коли тривога заповнює простір: шлях до спокою",
    desc: "Медитації, які допомагають відновити внутрішній спокій",
    article:
      "У кожного з нас бувають моменти, коли тривога наче туман огортає думки, не даючи побачити ясне небо. Це відчуття ніби нескінченний внутрішній шум, який здається нестерпним і безвихідним. Однак саме у такі миті ми особливо гостро потребуємо заземлення, повернення до себе і пошуку свого внутрішнього центру. Ця стаття — про те, як упізнати тривогу і почати рухатися до спокою через прості, але ефективні практики. Тривога — це природна реакція організму на невизначеність чи загрози, проте коли вона стає постійною супутницею, це може негативно впливати на наше емоційне й фізичне здоров’я. Першим кроком на шляху до спокою є прийняття власних відчуттів без осуду. Важливо усвідомити: тривога — це сигнал, що наше тіло і розум намагаються привернути увагу до чогось важливого. Психологічні підходи, зокрема когнітивно-поведінкова терапія, пропонують розпізнавати і переоцінювати думки, які підживлюють тривожність. Наприклад, замість думки «Я не в змозі впоратися», можна сформулювати: «Це складна ситуація, але я зможу знайти рішення поступово». Такий перенаправлений фокус спонукає мозок сприймати події менш загрозливо. Крім роботи з думками, надзвичайно корисним є увагу до дихання. Практика глибокого й усвідомленого дихання допомагає знизити рівень стресу і повернути себе до теперішнього моменту. Достатньо присісти або лягти в зручній позі, закрити очі і повільно вдихати через ніс, відчуваючи, як живіт піднімається, а потім повільно видихати через рот. Корисно робити це протягом п’яти-семи хвилин, концентруючись виключно на відчуттях дихання. Така проста практика запускає реакцію релаксації в нервовій системі, знижує частоту серцебиття і розсіює напругу. Ще одним важливим інструментом є ведення щоденника емоцій. Записування своїх думок і почуттів дозволяє вивільнити накопичену тривогу та отримати зворотній зв’язок із собою. Часто те, що ми носимо всередині, набирає чіткішої форми, коли ми записуємо його на папері — це допомагає краще зрозуміти, що саме нас турбує, і знайти шляхи розв’язання проблеми. До того ж, проглядаючи записи через деякий час, можна помітити позитивні зміни і стійкість, що підсилює віру у власні ресурси. Майндфулнес — усвідомлена присутність у моменті — це ще один шлях до спокою, що стає дедалі популярнішим у психологічній практиці. Навчившись зосереджувати увагу на відчуттях тут і зараз, без оцінок і прогнозів, ми даємо собі дозвіл відпустити розбурхані думки і зменшити тривожний фон. Це можна робити під час прогулянки, прийняття ванни або навіть миття посуду — достатньо помітити звуки, запахи, відчуття власного тіла. Звичка регулярно практикувати майндфулнес сприяє створенню внутрішньої безпеки і зменшує реактивність на стресові ситуації. Отже, коли тривога здається шаленим вихором, що поглинає все навколо, варто пам’ятати: у вас є інструменти, які допоможуть знайти дорогу назад до спокою. Прийняття своїх відчуттів, робота з думками, усвідомлене дихання, щоденник і майндфулнес — це не тільки техніки, а й акт турботи про себе, повага до власного внутрішнього світу. Кожен крок, навіть найменший, наближає до гармонії і внутрішньої стійкості. Ваша тривога не визначає вас — вона лише сигнал, який можна почути і зрозуміти. Не бійтеся звертатися по підтримку і досліджувати власні ресурси. Справжній шлях до спокою починається з маленьких практичних кроків і відкритості до себе. Залишайтеся з нами, і в наступних статтях ми детальніше розглянемо ефективні техніки і підходи, які допоможуть керувати тривогою й знаходити баланс у повсякденному житті.",
    rate: 16,
    ownerId: {
      $oid: "6881563901add19ee16fd018",
    },
    date: "2025-03-27",
  },
  {
    _id: {
      $oid: "68498236a100312bea078fe7",
    },
    img: "https://ftp.goit.study/img/harmoniq/8f8dc0265a01464db5b04757qz.jpg",
    title: "10 порад для збереження ментального балансу",
    desc: "Щоденні ритуали для ментального здоров’я",
    article:
      "У сучасному світі, де 끊но мінливі обставини та стрімкий темп життя, збереження ментального балансу стає справжнім викликом. Часто ми занурюємося в потік справ і емоцій, забуваючи про себе і свої потреби. Проте саме щоденні ритуали можуть стати міцним фундаментом для збереження внутрішньої гармонії і стійкості. Ця стаття допоможе відкрити прості, але дієві способи підтримувати емоційне здоров’я щодня, не втрачаючи зв’язок із собою. Перш за все, важливо навчитися зупинятися і прислухатися до власних емоцій та тілесних відчуттів. Практика майндфулнес, або усвідомленої присутності, дозволяє нам зосередитися на теперішньому моменті, не дозволяючи тривожним думкам і переживанням затопити свідомість. Наприклад, можна приділити кілька хвилин ранком чи ввечері, щоб усвідомлено вдихнути, звертаючи увагу на рух повітря в тілі, або придивитися до навколишнього світу з новою відкритістю. Такі маленькі паузи допомагають знизити рівень стресу і повернути відчуття спокою. Наступним важливим кроком є ведення щоденника емоцій або думок. Записування переживань не лише допомагає зрозуміти власні внутрішні процеси, а й створює відчуття контролю над ситуацією. Коли ми фіксуємо, що відбувається всередині, стає простіше відстежувати позитивні та негативні шаблони свого мислення, розрізняти тригери стресу та надавати собі підтримку у складних моментах. Спробуйте ввечері записувати кілька речень про те, що принесло вам радість, та що викликало дискомфорт. Такий маленький ритуал з часом допоможе наблизитися до кращого розуміння себе. Водночас тілесно-орієнтовані практики здатні покращити зв’язок між тілом і психікою. Наприклад, прості вправи на усвідомлене дихання здатні заспокоїти нервову систему і полегшити напругу, що накопичується під час насиченого дня. Техніка «4-7-8» — вдих на 4 секунди, затримка дихання на 7 секунд і повільний видих на 8 — допомагає перейти у стан релаксації навіть у момент стресу. Крім того, рекомендується звертати увагу на свої фізичні відчуття і дбайливо ставитися до тіла: регулярні прогулянки на свіжому повітрі, помірна фізична активність, тілесні релаксації або масажі допомагають зняти м’язову напругу і покращують самопочуття. Останній аспект — це розвиток когнітивних навичок навмисної роботи з власними думками. Когнітивно-поведінкова терапія пропонує усвідомлювати і модифікувати автоматичні негативні установки, які часто підсилюють тривогу й знижують самооцінку. Наприклад, замість загальної думки «я ніколи не справляюся» варто спробувати конкретизувати ситуацію і знайти альтернативний погляд: «іноді буває важко, але я можу навчатися і покращуватися». Така практика формує стійкість до стресів і розвиває самоспівчуття. Застосовуючи ці поради систематично, ми вчимося піклуватися про себе комплексно — у тілі, розумі й емоціях. Пам’ятайте, що дбайливе ставлення до власного ментального здоров’я — це не одномоментна дія, а поступова і глибока робота, яка вимагає терпіння і віри у власні сили. Приймайте кожен день як можливість зробити крок назустріч гармонії, і ця подорож принесе плоди не лише у вигляді спокою, а й більшої життєвої радості та стимулу до розвитку.",
    rate: 31,
    ownerId: {
      $oid: "6881563901add19ee16fcff3",
    },
    date: "2025-05-14",
  },
  {
    _id: {
      $oid: "68498236a100312bea078fe8",
    },
    img: "https://ftp.goit.study/img/harmoniq/9e3337f6661a4deaa5bcdd33dm.jpg",
    title: "Сила тиші: як медитація лікує душу",
    desc: "Техніки майндфулнес для душевної рівноваги",
    article:
      "Іноді тиша мовчить голосніше за будь-які слова. У світі, сповненому шуму й безперервних завдань, ми все більше віддаляємося від внутрішньої гармонії, залишаючись наодинці зі своєю тривогою, стресом і сумнівами. Медитація, особливо практики майндфулнес, відкривають нам простір тиші, який може стати справжнім ліком для душі. Ця стаття розповість, як через усвідомленість знайти баланс та відчути внутрішній спокій навіть у найхаотичніші моменти життя. /n Перш за все, важливо зрозуміти, що майндфулнес — це не втеча від реальності і не спосіб позбутися негараздів миттєво. Це вміння бути тут і зараз, помічати свої думки, почуття та тілесні відчуття без оцінок і критики. Коли ми вчимося зупинятись, навіть на кілька хвилин упродовж дня, тіло і розум отримують можливість відновитися. Один із простих способів почати — зосередитися на диханні. Уявіть собі, що кожен вдих насичує вас спокоєм, а видих — забирає тривогу. Регулярна практика такого усвідомленого дихання допомагає розпізнати, коли напруга накопичується, і дає інструмент для її зняття. /n Друге, що варто впровадити — ведення щоденника емоцій. Записуючи щоденні переживання без цензури, ви створюєте безпечний простір для діалогу з собою. Це не просто спосіб організувати думки, а ключ до глибшого розуміння своїх реакцій. Через такі записи можна помітити повторювані патерни, які викликають тривогу чи роздратування, і навчитися працювати з ними свідомо. Часто це стає першим кроком до подолання внутрішнього дисбалансу/ /n Когнітивно-поведінкові техніки, зокрема усвідомлення автоматичних думок, органічно поєднуються з медитацією. Присутність у моменті допомагає помітити негативні програми мислення, які швидко запускають ланцюг емоційного дискомфорту. Коли ви спостерігаєте ці думки як сторонній, можна обрати іншу перспективу — замінити критику на більш підтримуючі формулювання. Наприклад, замість «Я ніколи не впораюся» можна сказати собі «Я роблю все можливе, і це вже крок вперед». Це не магія, а результат регулярної роботи над своєю свідомістю. /n Не менш важливим є тілесно-орієнтований підхід, що допомагає заземлити себе через відчуття свого тіла. Прості вправи: напруження та розслаблення м’язів, усвідомлення дотиків чи навіть легкий масаж рук можуть стати якорем у теперішньому моменті та пом'якшують вплив стресу. Коли ми навчаємося чути своє тіло без остраху чи бажання втекти від неприємних відчуттів, з'являється новий рівень внутрішнього спокою і прийняття. /n Сила тиші подекуди недооцінена, але в ній криється неймовірна можливість помиритися із собою та світом. Медитація і техніки майндфулнес — це не спорт, у якому важливо виграти, а шлях пізнання й співчуття до себе. Коли ви зробите перший крок назустріч усвідомленості, навіть найскладніші дні стануть трохи легшими. Пам’ятайте, що кожна хвилина, проведена в тиші і спокої, — це подарунок, який ви робите власній душі. Відчуйте цю силу і дозвольте їй лікувати вас.",
    rate: 2,
    ownerId: {
      $oid: "6881563901add19ee16fd019",
    },
    date: "2025-07-23",
  },
  {
    _id: {
      $oid: "68498236a100312bea078fe9",
    },
    img: "https://ftp.goit.study/img/harmoniq/d270b2a2bc7c4366a6e7eefeav.jpg",
    title: "Заземлення у світі хаосу: як зберегти себе",
    desc: "Як не втратити себе у рутині",
    article:
      "У світі, де нескінченний потік новин, вимог і невизначеності створює відчуття постійного хаосу, дуже легко загубити себе. Кожен день ми стикаємося з безліччю викликів, і ці турботи часто затуманюють нашу внутрішню рівновагу. Заземлення – це не просто модне слово, а необхідний механізм, який допомагає нам зберігати опору всередині себе, не втрачаючи цілісності у світі, що стрімко змінюється. Ця стаття пропонує глибокий, але доступний погляд на те, як залишатися собою навіть тоді, коли все навколо здається нестабільним.  /n Перш за все, заземлення починається з усвідомлення свого тіла та простору навколо. Коли хаос захльостує думки, наше фізичне тіло може стати опорою, яка повертає нас у теперішній момент. Одна з найдоступніших технік – це дихання. Глибокі, повільні вдихи й видихи на кілька хвилин дозволяють знизити рівень тривоги та повернути контроль над емоціями. Можна уявити себе коренями дерева, що міцно тримаються за землю кожним вдохом. Таке тілесне усвідомлення допомагає «заспокоїти бурю» в голові і налаштуватися на внутрішній порядок. /n Ще одним потужним інструментом є ведення щоденника. Записування власних думок і почуттів – це спосіб проявити турботу про себе і вивільнити внутрішній тиск. Щоденник стає безпечним простором, де немає осуду, а є тільки чесність. Його можна використовувати для визначення тригерів тривоги або відчуття розпачу, а також для фіксації позитивних моментів, які допомагають відчути власні ресурси. Ця практика сприяє усвідомленості і спрямовує на шлях саморефлексії. /n Практика майндфулнес – ще один спосіб заземлитися в реальності. Вона дозволяє відчути повноту життя в кожній миті, не піддаючись автоматичним реакціям і інтенсивним емоціям. Навчаючись спостерігати за думками без оцінки, ми вчимось розрізняти, які з них є корисними, а які – просто шумом. Наприклад, можна приділяти кілька хвилин на день, зосереджуючись на відчуттях у тілі, на звуках або на ритмі власного дихання. Це допоможе тренувати стійкість і зберігати твердість навіть у моменти невизначеності. /n Когнітивно-поведінкова терапія пропонує практичний підхід до розуміння і зміни власних переживань. Вона вчить ідентифікувати негативні автоматичні думки, які часто підсилюють відчуття тривоги і безпорадності, і замінювати їх більш реалістичними та розсудливими. Наприклад, якщо нав’язлива думка каже: «Я не справлюся», можна поставити собі запитання: «Чи є факти, які це підтверджують?» Або: «Що зробив я раніше, щоб справитися з подібними ситуаціями?» Такий аналіз відновлює контроль і зміцнює віру у власні сили. /n Завершуючи, варто пам’ятати: заземлення – це не миттєва фіксація, а тривалий процес підтримки власної стійкості серед зовнішнього хаосу. Запропоновані практики – дихання, щоденник, майндфулнес і когнітивні техніки – можуть стати вашими надійними супутниками на цьому шляху. Найголовніше – бути до себе терплячим і дбайливим. У світі, де все змінюється так швидко, зберігати себе – це найбільша цінність, яку ми можемо дати собі. Ви не самотні, і кожен крок до власного заземлення – це крок до справжньої свободи всередині.",
    rate: 9,
    ownerId: {
      $oid: "6881563901add19ee16fcfff",
    },
    date: "2024-09-28",
  },
  {
    _id: {
      $oid: "68498236a100312bea078fea",
    },
    img: "https://ftp.goit.study/img/harmoniq/657fb4a2deb7421eafde0cd0ja.jpg",
    title: "Гармонія в повсякденності: практичні техніки",
    desc: "Роздуми про гармонію і баланс у сучасному світі",
    article:
      "У швидкому ритмі сучасного життя часто складно віднайти тишу, рівновагу та внутрішній спокій. Ми прагнемо балансу, але щоденні виклики, непередбачувані обставини та емоційний навантаження відволікають і випробовують нашу стійкість. Гармонія — це не стан храму, застиглого у часі, а жива, плинна якість, яку можна культивувати щодня. Сьогодні я пропоную разом замислитись над тим, як можна впровадити практичні техніки для гармонізації свого життя, щоб внутрішній світ став надійною опорою у будь-якій ситуації. /n Перш за все, важливо освоїти усвідомлене дихання. Ця проста практика, що часто недооцінюється, може стати вашим першим помічником у моменти тривоги чи перевантаження. Зосереджуючи увагу на процесі вдиху та видиху, ми повертаємо тіло в стан спокою та безпеки. Спробуйте почати з кількох глибоких, повільних вдихів, рахуючи до чотирьох, затримуючи повітря на два рахунки і повільно видихаючи. Регулярне застосування цієї техніки допоможе знижувати рівень стресу і налаштовуватися на позитивний лад. /n Свідомість тут і зараз — найкращий шлях до гармонії. Практика майндфулнес, або усвідомленої присутності, вчить нас приймати кожен момент таким, яким він є, без оцінок і суперечок із реальністю. Присвячуйте час, щоб просто спостерігати за своїми думками, відчуттями чи навіть навколишнім світом навколо – це можна робити під час прогулянки, пиття кави чи виконання простих побутових справ. Такий підхід допомагає відпустити зайві турботи і заземлитися у теперішньому. /n Щоденник емоцій ставить перед нами живий діалог із собою. Записуючи переживання, ми краще розуміємо, що відбувається всередині, і часто змінюємо сприйняття складних ситуацій. Цей метод особливо корисний, коли емоції перевантажують, адже письмова рефлексія дозволяє відсторонитися і оцінити усе з нової перспективи. Не обов’язково складати об’ємні тексти — кілька речень про те, як ви почуваєтеся, вже зможуть внести ясність і позбутися тривоги. /n Окрім цього, варто звернути увагу на когнітивні техніки, які допомагають позбутися деструктивних думок і налагодити внутрішній діалог. Один із простих прийомів — перевірка фактів у своїх переконаннях. Якщо з'являються думки про те, що ви не впораєтеся чи щось піде не так, зупиніться і задайте собі питання: 'Чи є реальні підстави для цього?' або 'Що скажу близькій людині у такій ситуації?' Такий «переклад» власних побоювань у об’єктивну форму часто відкриває шлях до більш збалансованого осмислення. /n Гармонія в повсякденності — це не ідеал, якого слід досягти один раз назавжди, а процес, який потребує уваги та доброї волі. Прості практики дихання, майндфулнес, ведення щоденника та когнітивний аналіз допомагають зробити цей шлях більш усвідомленим і легким. Пам’ятайте, що турбота про емоційний стан — це важливий акт любові до себе. Не бійтеся експериментувати, шукати свої способи балансу і приймати кожен день як ще одну можливість бути у гармонії з собою та світом.",
    rate: 12,
    ownerId: {
      $oid: "6881563901add19ee16fd008",
    },
    date: "2024-11-26",
  },
  {
    _id: {
      $oid: "68498236a100312bea078feb",
    },
    img: "https://ftp.goit.study/img/harmoniq/46e4d497c2b7455098769007uq.jpg",
    title: "Коли тривога заповнює простір: шлях до спокою",
    desc: "Медитації, які допомагають відновити внутрішній спокій",
    article:
      "Відчуття тривоги іноді може стати таким наповнювачем нашого внутрішнього простору, що здається — виходу немає, а всі думки лише посилюють тягар. Це наче хвиля, що накриває з усіх боків, і з нею важко боротися. Однак у кожного з нас є можливість знайти в собі ресурс, який допоможе заспокоїти цей буревій і відновити зв’язок із внутрішнім спокоєм. Адже спокій — це не відсутність тривоги, а навичка жити разом із нею, не дозволяючи їй керувати нашим життям. /n Перший крок на цьому шляху — усвідомлення своїх відчуттів без осуду. Коли тривога виникає, важливо не боротися з нею насильно, а навчитись спостерігати за нею. Практики майндфулнес, які базуються на уважній присутності у теперішньому моменті, допомагають просто помічати тривожні думки і почуття, не надаючи їм додаткової сили. Наприклад, спробуйте закрити очі, зосередитися на диханні та дозволити думкам приходити і йти, ніби хмари на небі. Такий простий акт прийняття може зняти напругу і повернути відчуття контролю. /n Наступним дієвим інструментом є техніки дихання, які однаково підтримують як розум, так і тіло у стані рівноваги. Коли тривожність росте, наше дихання стає поверхневим і швидким, що лише підсилює паніку. Один із простих способів повернути собі відчуття спокою — це практикувати глибоке дихання. Наприклад, дихання за методикою 4-7-8: глибоко вдихнути на рахунок до чотирьох, затримати подих на сім секунд, а потім повільно видихнути протягом восьми секунд. Регулярна практика цієї техніки може заспокоїти нервову систему і зменшити рівень напруги. /n Ще одна корисна стратегія — ведення щоденника тривог. Записуючи свої переживання, ми надаємо їм форму, що допомагає краще зрозуміти корені непокоєння. Іноді, записуючи думки на папері, ми виявляємо, що багато тривожних сценаріїв — перебільшені або навіть не настільки й реальні. Це дає змогу подивитись на себе об’єктивніше і за допомогою когнітивно-поведінкових технік поступово змінювати свої ментальні установки. Наприклад, можна спробувати ставити під сумнів катастрофічні думки, шукаючи більш раціональні й збалансовані альтернативи. /n Окрім психічної роботи, не варто забувати і про тілесні практики. Тілесно-орієнтована терапія, йога чи прості розтяжки можуть допомогти зняти зажимання і повернути відчуття легкості у тілі, що є важливим кроком на шляху до внутрішнього спокою. Регулярне рухання у комфортному режимі активізує парасимпатичну нервову систему, сприяючи відновленню гармонії після пережитих хвиль тривоги. /n Наостанок: шлях до спокою — це не одномоментне рішення, а поступовий процес глибокого пізнання себе і розвитку навичок впливу на свій внутрішній стан. Кожна хвилина, проведена у свідомому заспокоєнні, — це інвестиція у власне благополуччя. Пам’ятайте, що навіть у найскладніші моменти ви не самі, і підтримка завжди поруч — у ваших руках, у диханні, у словах, які ви говорите собі, у ніжній увазі до власного тіла. /n Приймайте тривогу як частину свого досвіду, але не дозволяйте їй контролювати ваше життя. Застосування простих, але потужних практик допоможе відновити внутрішній баланс і створити той простір спокою, якого ви так прагнете.",
    rate: 25,
    ownerId: {
      $oid: "6881563901add19ee16fd01a",
    },
    date: "2025-06-07",
  },
  {
    _id: {
      $oid: "68498236a100312bea078fec",
    },
    img: "https://ftp.goit.study/img/harmoniq/25deb638ecc54a37a8263bd2ct.jpg",
    title: "10 порад для збереження ментального балансу",
    desc: "Щоденні ритуали для ментального здоров’я",
    article:
      "У сучасному світі, де інформаційний потік не припиняється ні на мить, а вимоги оточення здаються необґрунтовано високими, зберегти ментальний баланс стає справжнім викликом. Кожен із нас час від часу відчуває внутрішній дискомфорт, напругу або втому, що можуть поступово переростати у більш серйозні проблеми, якщо не приділяти уваги власному емоційному стану. Добре налагоджені щоденні ритуали здатні стати надійним фундаментом для підтримки психічного здоров’я, допомагаючи залишатися у ресурсі навіть у найскладніші дні. Ця стаття присвячена тому, як через прості, але ефективні практики можна зберегти і поглибити внутрішню рівновагу. /n Перш за все, важливо зауважити, що ментальний баланс — це не стан абсолютної відсутності негативних емоцій, а уміння приймати їх, знижувати напругу та відновлювати внутрішній спокій. Одним із ключових інструментів є усвідомлене дихання. Відома практика глибокого діафрагмального дихання дозволяє не лише фізично розслабитися, а й переключити увагу від тривожних думок до теперішнього моменту. Прості вправи, які можна робити кілька хвилин на день, допомагають розвантажити нервову систему: наприклад, повільний вдих на чотири секунди, затримка дихання на сім секунд і плавний видих на вісім секунд. Цей ритм не лише зменшує рівень стресу, а й сприяє стабілізації емоцій. /n Ще одним потужним інструментом для підтримки ментального здоров’я є ведення щоденника. Записи власних думок і почуттів допомагають краще зрозуміти себе, усвідомити внутрішні переживання та впорядкувати хаос думок. Важливо не прагнути до того, щоб кожен запис був ідеальним — навпаки, необхідно дозволити собі відкритість і чесність, не осуджуючи власні емоції. Такий саморефлексивний процес часто використовується у когнітивно-поведінковій терапії, адже він розвиває здатність помічати візерунки мислення і змінювати їх, якщо вони несуть тривогу чи негатив. /n Впровадження практик майндфулнес і тілесної усвідомленості сприяє глибшому контакту з теперішнім моментом та власним тілом, що надзвичайно важливо для підтримки емоційного балансу. Це можуть бути короткі паузи протягом дня, коли можна просто помітити відчуття у тілі, спостерігати за навколишніми звуками або розглядати предмети довкілля без оцінок. Такий підхід дозволяє переключитися з автоматичного режиму в більш свідомий, знижуючи рівень тривожності. Регулярна практика також може включати легкі тілесні вправи, наприклад, розтяжку або йогу, які допомагають розблокувати зажимання та напругу, накопичені у м’язах. /n Не менш екологічним підходом до збереження ментального здоров’я є усвідомлене планування часу та встановлення меж, які допомагають уникати перевантаження. Використання технік тайм-менеджменту у поєднанні з уважним ставленням до власних потреб дає змогу помічати, коли настав період виснаження, і своєчасно робити паузи для відновлення. Дуже важливо навчитися «говорити ні» тоді, коли це необхідно, захищаючи власний ресурс. Адже психологічне благополуччя потребує не тільки активних дій, а й розуміння меж своїх можливостей і турботи про себе. /n Отже, збереження ментального балансу — це комплексний процес, який включає в собі уважне ставлення до себе, застосування простих практик і створення безпечного емоційного простору. Глибоке дихання допомагає заспокоїти розум і тіло, щоденникові записи сприяють саморефлексії, майндфулнес тренує усвідомленість, а планування часу забезпечує захист від вигорання. Застосовуючи ці поради у щоденному житті, ви не лише покращите свій емоційний стан, а й зміцните зв’язок із собою, що є фундаментом для гармонійного життя. Незалежно від того, з якими викликами ви стикаєтесь, пам’ятайте: турбота про ментальне здоров’я — це акт любові і поваги до себе, який заслуговує на вашу увагу кожного дня.",
    rate: 41,
    ownerId: {
      $oid: "6881563901add19ee16fcffb",
    },
    date: "2024-10-14",
  },
  {
    _id: {
      $oid: "68498236a100312bea078fed",
    },
    img: "https://ftp.goit.study/img/harmoniq/74871f8b7e734039b7645bbdee.jpg",
    title: "Сила тиші: як медитація лікує душу",
    desc: "Техніки майндфулнес для душевної рівноваги",
    article:
      "У сучасному світі, де інформаційний потік не припиняється ні на секунду, а думки часто блукають між минулим і майбутнім, тиша стає рідкісним і цінним ресурсом. Саме в тиші, здається, ми можемо почути найголосніші голоси — голос свого серця, своїх потреб і справжніх почуттів. Медитація, яка часто асоціюється з тишею і спокоєм, відкриває двері до внутрішнього світу, допомагаючи відновити душевний баланс, зняти тривогу і знайти гармонію з самим собою. /n Розгляньмо, як медитація та техніки майндфулнес можуть зробити цей шлях до душевної рівноваги доступним у повсякденному житті. /n Перш за все, необхідно усвідомити, що основа медитації — це присутність у моменті теперішньому. Замість того, щоб дозволяти розуму блукати між минулими переживаннями чи побоюваннями за майбутнє, медитація навчає спостерігати думки без оцінки. Практикуючи це, людина стає більше уважною до свого внутрішнього стану і навчається помічати появу тривоги або негативних емоцій на самому початку. Наприклад, починаючи день із короткої практики спостереження за диханням, можна налаштуватися на спокійний і усвідомлений ритм життя, що в подальшому допомагає зменшити реактивність на стресові ситуації. /n Однією з найбільш доступних технік у майндфулнес є фокусування на диханні. Дихання завжди з нами, і саме воно зв’язує тіло і розум. Навчившись повільно та глибоко дихати під час хвилювання, можна активувати парасимпатичну нервову систему, що відповідає за відпочинок і відновлення. Для початку варто спробувати сісти зручно, закрити очі та звернути увагу на процес вдиху і видиху. Якщо думки відволікають, не варто боротися із ними — досить м’яко повернути увагу до дихання. Ця проста вправа допомагає зменшити рівень тривоги і поступово входити у стан глибшої внутрішньої тиші. /n Крім того, важливо вчитися приймати свої емоції без осуду. Часто ми намагаємося уникнути неприємних почуттів, що лише збільшує їхню силу і напругу. Практики майндфулнес пропонують присвятити кілька хвилин усвідомленому спостереженню за тим, що відчуваємо в тілі і розумі, не намагаючись змінити цю картину. Наприклад, якщо з’являється відчуття тривоги, можна тихо й лагідно запитати себе, де саме в тілі вона локалізується, які відчуття супроводжують її. Такий підхід допомагає розірвати замкнене коло негативних реакцій і відновити контакт із собою. /n Ведення щоденника — ще один корисний інструмент на шляху до душевної рівноваги. Записи про переживання, думки і почуття допомагають більш чітко усвідомити власні реакції і поступово керувати ними. Наприклад, після медитативної практики можна кілька хвилин присвятити тому, щоб описати свої відчуття або нові усвідомлення. Цей процес зазвичай сприяє зниженню емоційного напруження і подальшому саморозвитку. /n Підсумовуючи, медитація і майндфулнес — це не магічні рішення, а системні практики, які допомагають відчути силу тиші та уваги всередині себе. Вони відкривають шлях до глибшого розуміння власної душі, зняття тривоги і створення внутрішньої гармонії. Важливо пам’ятати, що навіть короткі щоденні зусилля можуть привести до значних змін в емоційному благополуччі. Тож не бійтесь зупинитися на мить, послухати себе і подарувати собі цей цінний простір тиші — ваша душа цього варта.",
    rate: 2,
    ownerId: {
      $oid: "6881563901add19ee16fd015",
    },
    date: "2025-05-28",
  },
  {
    _id: {
      $oid: "68498236a100312bea078fee",
    },
    img: "https://ftp.goit.study/img/harmoniq/4185d68f321c49b591f7e879ek.jpg",
    title: "Заземлення у світі хаосу: як зберегти себе",
    desc: "Як не втратити себе у рутині",
    article:
      "У світі, де інформація ллється нескінченно, а події змінюють одна одну зі швидкістю світла, дуже легко відчути себе розгубленим і роздрібненим. Здається, що щоденні турботи, тривоги та нескінченні завдання пожирають нашу енергію, залишаючи у душі порожнечу. Саме в такі моменти нам потрібне заземлення — внутрішній якор, який допоможе повернутися до себе, зберегти ясність і спокій у світі хаосу. Саме цьому і присвячена ця стаття — про те, як не загубити себе серед буденної суєти та залишатися цілісним і живим. /n Перший крок до заземлення — це уважність до власного тіла і тут і зараз. Практики майндфулнес давно довели свою ефективність у зніманні стресу і відновленні внутрішньої гармонії. Замість того, щоб поринати у вир думок про минуле чи виснажливі очікування майбутнього, спробуйте зупинитися хоча б на кілька хвилин і просто спостерігати свої відчуття. Відчуйте, як ваші ноги торкаються підлоги, як б’ється серце, як повітря входить і виходить з легень. Ця проста практика повертає у реальність і дозволяє побачити: ви тут і зараз, ви живі. Важливо не оцінювати свої відчуття, а приймати їх з добротою, без зайвого аналізу. /n Другим важливим інструментом є ведення щоденника. Записування думок і емоцій допомагає краще розібратися у власних переживаннях, а також знизити внутрішнє напруження. Не обов’язково писати довгі тексти – достатньо кількох речень про те, що ви відчували сьогодні, які події викликали радість чи сум. Такий режим дозволяє не накопичувати негатив, а відпускати його, формулювати нові цілі і навіть знаходити несподівані рішення. З часом ведення щоденника стає своєрідним діалогом із самим собою, підтримкою в моменти сумнівів і невпевненості. /n Третім аспектом, що допомагає знайти заземлення, є тілесно-орієнтовані практики. Через напруження в тілі часто проходить наш стрес і тривога. Навчаючись розуміти сигнали свого тіла, ми можемо знайти прості способи покращити емоційний стан. Наприклад, п’ятихвилинна прогулянка на свіжому повітрі, глибоке дихання, розтягування м’язів чи практика йоги сприяють зменшенню напруги. Тілесна свідомість пов’язана з емоційним балансом: коли ми вчимося розпізнавати і приймати відчуття, то краще управляємо своїм настроєм і реакціями. Це дає відчуття контролю, безпеки і підтримки самого себе. /n Нарешті, дуже важливо працювати з власними думками за допомогою когнітивно-поведінкових технік. Вони допомагають усвідомити і змінити автоматичні негативні установки, які можуть загострювати тривожність і почуття безпорадності. Якщо ви помічаєте, що починаєте думати у стилі «я не справлюся» або «все йде не так», спробуйте зупинитися і поставити собі питання: наскільки ця думка відповідає дійсності? Які є докази за і проти? Часто раціональний аналіз допомагає збалансувати внутрішній діалог і знайти спокій. Підтримка таких здорових переконань служить основою для психологічного заземлення і зміцнення внутрішнього ресурсу. /n У світі хаосу і швидких змін наше емоційне благополуччя — це не просто стан, а навичка, яку можна і потрібно розвивати. Заземлення — це відповідь на виклики сучасності, спосіб не втратити себе у шумі думок і зовнішніх подій. Практики усвідомленості, щоденне відображення у письмі, тілесна увага та робота з думками створюють безпечний простір усередині нас. У цей простір можна повертатися щоразу, коли здається, що життя занурює у вир суєти. Пам’ятайте, що ви не самотні в своїх переживаннях, і турбота про себе — це не розкіш, а необхідність. Вчіться зупинятися, приймати себе і знаходити гармонію навіть у найбурхливіші часи. Так ви зможете зберегти внутрішній стрижень і крокувати життям з упевненістю і спокоєм.",
    rate: 22,
    ownerId: {
      $oid: "6881563901add19ee16fcffb",
    },
    date: "2025-06-13",
  },
];

const ArticlesPage = () => {
  const [isOpen, setIsOpen] = useState(false);
  const [filter, setFilter] = useState("All");
  const [articles, setArticles] = useState([]);

  const filters = ["All", "Popular"];

  /*const [page, setPage] = useState(1);
  const [count, setCount] = useState(0);
  const [hasMore, setHasMore] = useState(true);
  const limit = 5;

  const fetchArticles = async (reset = false) => {
    try {
      const res = await axios.get("/api/articles", {
        params: { type: filter, page: reset ? 1 : page, limit },
      });
      const { articles: newArticles, total, hasMore: more } = res.data;

      setCount(total);
      setHasMore(more);

      if (reset) {
        setArticles(newArticles);
        setPage(2);
      } else {
        setArticles((prev) => [...prev, ...newArticles]);
        setPage((prev) => prev + 1);
        window.scrollTo({ top: 0, behavior: "smooth" });
      }
    } catch (err) {
      console.error("Error fetching articles", err);
    }
  };

  useEffect(() => {
    fetchArticles(true);
  }, [filter]);*/

  /*---------------------------------------------------------*/

  useEffect(() => {
    let filtered = [...demoArticles];
    switch (filter) {
      case "Popular":
        filtered.sort((a, b) => b.views - a.views);
        break;

      case "All":
        break;

      default:
        filtered = filtered.filter((a) => a.type === filter);
        break;
    }

    setArticles(filtered);
  }, [filter]);

  return (
    <section>
      <Container>
        <SectionTitle title="Articles" />
        <div className={s.articlesHeader}>
          <span className={s.articleCount}>{articles.length} articles</span>
          <div className={s.dropdownWrapper}>
            <select
              value={filter}
              onChange={(e) => setFilter(e.target.value)}
              onClick={() => setIsOpen((prev) => !prev)}
              className={s.dropdown}
            >
              {filters.map((type) => (
                <option key={type} value={type}>
                  {type}
                </option>
              ))}
            </select>
            <img
              src={chevronIcon}
              alt=""
              width="16"
              height="16"
              className={`${s.dropdownIcon} ${isOpen ? s.open : ""}`}
              aria-hidden="true"
            />
          </div>
        </div>
        <ArticlesList articles={articles} />
      </Container>
    </section>
  );
};

export default ArticlesPage;
